app/views/jobs/_form.html.erb

SELECT "companies"."name", "companies"."id" FROM "companies"
---
    <%= form.label :company_id, t("jobs.new.labels.company"), class:"font-bold"%>
    <%= form.select :company_id, [["select Company",nil]]+Company.pluck(:name,:id), {}, class: "multiple" %>