app/controllers/companies_controller.rb

  def create
    @company = Company.create(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Silimu"], ["created_at", "2022-05-26 08:17:47.013466"], ["updated_at", "2022-05-26 08:17:47.013466"]]
UPDATE "companies" SET "updated_at" = $1 WHERE "companies"."id" = $2  [["updated_at", "2022-05-07 06:42:11.690377"], ["id", 5]]