app/controllers/jobs_controller.rb

SELECT "companies"."name", "companies"."id" FROM "companies"
---
  def new
    @job = current_user.jobs.build
    @companies = Company.pluck(:name, :id).sort_by { |company| company[0] }