app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", 0], ["LIMIT", 1]]
---
  def update_role!(role_name)
    self.role = Role.find_or_create_by(name: role_name)